app/Models/Usuarios.php

SELECT *
FROM `t_usuario`
WHERE `usuario` = 'jaime '
---
    public function obtenerUsuario($data) {
       $Usuario = $this->db->table('t_usuario');
       $Usuario->where($data);
       return $Usuario->get()->getResultArray();